Repository: Tom5521/fsize
Catalog: po/*/default.po
Languages: es, pt, ru

source: Displays the file/folder properties.
es: Muestra las propiedades del archivo/carpeta.
pt: Exibe as propriedades do arquivo/pasta.
ru: Отображает свойства файла/папки.

source: Prints the name of the file being walked if a directory has been selected.
es: Imprime el nombre del archivo recorrido si se seleccionó un directorio.
pt: Imprime o nome do arquivo sendo processado se um diretório foi selecionado.
ru: Выводит имя файла, если выбрана директория.

source: Skips walking inside the directories.
es: Evita recorrer dentro de los directorios.
pt: Ignora a navegação dentro das pastas.
ru: Пропускает просмотр содержимого директорий.

source: Displays a file count and progress bar when counting and summing file sizes.
es: Muestra el conteo de archivos y una barra de progreso al contar y sumar los tamaños de archivos.
pt: Exibe uma contagem de arquivos e barra de progresso ao contar e somar os tamanhos dos arquivos.
ru: Отображает количество файлов и индикатор прогресса при подсчете и суммировании размеров файлов.

source: Configure the variables used for preferences Example: "fsize --config 'always-show-progress=true,always-print-on-walk=false'". To see the available variables and their values run "fsize --print-settings".
es: Configura las variables usadas para preferencias Ejemplo: "fsize --config 'always-show-progress=true,always-print-on-walk=false'". Para ver las variables disponibles y sus valores ejecuta "fsize --print-settings".
pt: Configura as variáveis usadas para preferências Exemplo: "fsize --config 'always-show-progress=true,always-print-on-walk=false'". Para ver as variáveis disponíveis e seus valores, execute "fsize --print-settings".
ru: Настройка переменных для предпочтений Пример: "fsize --config 'always-show-progress=true,always-print-on-walk=false'". Чтобы увидеть доступные переменные и их значения, запустите "fsize --print-settings".

source: Prints the current configuration values.
es: Imprime los valores de configuración actuales.
pt: Imprime os valores atuais de configuração.
ru: Выводит текущие значения конфигурации.

source: Hide possible warnings.
es: Oculta posibles advertencias.
pt: Oculta possíveis avisos.
ru: Скрыть возможные предупреждения.

source: Generate a completion file for bash if any, the first argument will be taken as output file.
es: Genera un archivo de autocompletado para bash si hay alguno, el primer argumento se tomará como archivo de salida.
pt: Gera um arquivo de autocompletar para o bash se fornecido, o primeiro argumento será usado como arquivo de saída.
ru: Создает файл автозаполнения для bash если есть, первый аргумент будет взят как файл вывода.

source: Generate a completion file for fish if any, the first argument will be taken as output file.
es: Genera un archivo de autocompletado para fish si hay alguno, el primer argumento se tomará como archivo de salida.
pt: Gera um arquivo de autocompletar para o fish se fornecido, o primeiro argumento será usado como arquivo de saída.
ru: Создает файл автозаполнения для fish если есть, первый аргумент будет взят как файл вывода.

source: Generate a completion file for zsh if any, the first argument will be taken as output file.
es: Genera un archivo de autocompletado para zsh si hay alguno, el primer argumento se tomará como archivo de salida.
pt: Gera um arquivo de autocompletar para o zsh se fornecido, o primeiro argumento será usado como arquivo de saída.
ru: Создает файл автозаполнения для zsh если есть, первый аргумент будет взят как файл вывода.

source: Automatically updates the program by overwriting the binary and regenerating the completions.
es: Actualiza automáticamente el programa sobrescribiendo el binario y regenerando las autocompletaciones.
pt: Atualiza automaticamente o programa substituindo o binário e regenerando os arquivos de autocompletar.
ru: Автоматически обновляет программу, перезаписывая бинарный файл и регенерируя автозаполнения.

source: Displays the information of the binary
es: Muestra la información del binario
pt: Exibe as informações do binário
ru: Отображает информацию о бинарном файле

source: Disable any progress indicator.
es: Desactiva cualquier indicador de progreso.
pt: Desativa qualquer indicador de progresso.
ru: Отключить отображение индикатора прогресса.

source: Specifies how long the program should be counting files before a progress indicator appears
es: Especifica cuánto tiempo el programa debería estar contando archivos antes de que aparezca un indicador de progreso
pt: Especifica por quanto tempo o programa deve contar arquivos antes que um indicador de progresso apareça
ru: Указывает, как долго программа должна подсчитывать файлы, прежде чем появится индикатор прогресса

source: If the pattern is not "", only files that match it will be included in the count. The pattern must be a regular expression unless the --wildcard flag on
es: Si el patrón no es "", solo los archivos que coincidan con él serán incluidos en el conteo. El patrón debe ser una expresión regular a menos que la bandera --wildcard esté activada
pt: Se o padrão não for "", apenas os arquivos que corresponderem a ele serão incluídos na contagem. O padrão deve ser uma expressão regular, a menos que a flag --wildcard esteja ativa
ru: Если шаблон не является «», то в подсчет будут включены только файлы, соответствующие этому шаблону. Шаблон должен быть регулярным выражением, если не указан флаг --wildcard

source: If ignore is not "", the files that match it will be excluded from the count. The pattern must be a regular expression unless the --wildcard flag is on
es: Si ignore no es "", los archivos que coincidan con él serán excluidos del conteo. El patrón debe ser una expresión regular a menos que la bandera --wildcard esté activada
pt: Se ignore não for "", os arquivos que corresponderem a ele serão excluídos da contagem. O padrão deve ser uma expressão regular, a menos que a flag --wildcard esteja ativa
ru: Если ignore не равно «», файлы, соответствующие этому шаблону, будут исключены из подсчета. Шаблон должен быть регулярным выражением, если не установлен флаг --wildcard

source: Switches --ignore & --pattern from regular expressions to wildcard patterns
es: Cambia --ignore y --pattern de expresiones regulares a patrones comodín
pt: Muda --ignore e --pattern de expressões regulares para padrões curinga
ru: Переключает --ignore и --pattern с регулярных выражений на шаблоны с подстановочными знаками

source: Prevents the progress indicator from being cleared after finishing
es: Evita que el indicador de progreso se borre después de finalizar
pt: Impede que o indicador de progresso seja limpo após a conclusão
ru: Предотвращает очистку индикатора прогресса после завершения

source: Indicates the maximum depth to traverse within a directory; files/directories deeper than this will be skipped
es: Indica la profundidad máxima para recorrer dentro de un directorio; archivos/directorios más profundos que esto serán omitidos
pt: Indica a profundidade máxima a percorrer dentro de uma pasta; arquivos/pastas mais profundos que isso serão ignorados
ru: Указывает максимальную глубину обхода внутри директории; файлы/директории, находящиеся глубже, будут пропущены

source: Indicates the maximum number of warnings that will be printed. If it is -1, there is no limit.
es: Indica el número máximo de advertencias que se imprimirán. Si es -1, no hay límite.
pt: Indica o número máximo de avisos que serão impressos. Se for -1, não há limite.
ru: Указывает максимальное количество предупреждений, которые будут напечатаны. Если значение -1, ограничения нет.

source: Indicates the log level, which can be debug, info, warn, error, or fatal.
es: Indica el nivel de registro, que puede ser debug, info, warn, error o fatal.
pt: Indica o nível de log, que pode ser debug, info, warn, error ou fatal.
ru: Указывает уровень ведения журнала, который может быть: debug, info, warn, error или fatal.

source: If enabled, the program will follow symbolic links
es: Si está habilitado, el programa seguirá enlaces simbólicos

source: Available configuration keys:
es: Claves de configuración disponibles:
pt: Chaves de configuração disponíveis:
ru: Доступные ключи конфигурации:

source: Already in latest version
es: Ya está en la última versión
pt: Já está na versão mais recente
ru: Уже установлена последняя версия

source: Self-upgradable:
es: Auto-actualizable:

source: Version:
es: Versión:
pt: Versão:
ru: Версия:

source: Updated:
es: Actualizado:
pt: Atualizado:
ru: Обновлено:

source: Latest version:
es: Última versión:
pt: Última versão:
ru: Последняя версия:

source: (the hashes differ)
es: (los hashes difieren)

source: Source Code: %s
es: Código Fuente: %s
pt: Código-fonte: %s
ru: Исходный код: %s

source: No file/directory was specified, the current directory will be used. (.)
es: No se especificó ningún archivo/directorio, se usará el directorio actual. (.)
pt: Nenhum arquivo/pasta foi especificado. O diretório atual será usado. (.)
ru: Файл/директория не указаны, будет использована текущая директория. (.)

source: syntax error
es: error de sintaxis
pt: erro de sintaxe
ru: синтаксическая ошибка

source: unrecognized key "%s"
es: clave no reconocida "%s"
pt: chave não reconhecida "%s"
ru: неопознанный ключ "%s"

source: invalid time duration(%s): %s
es: duración de tiempo inválida(%s): %s
pt: duração de tempo inválida(%s): %s
ru: недействительная продолжительность времени (%s): %s

source: unrecognized value type "%s"
es: tipo de valor no reconocido "%s"
pt: tipo de valor não reconhecido "%s"
ru: неопознанный тип значения "%s"

source: file birthtime is not supported
es: la fecha de creación del archivo no está soportada
pt: data de criação do arquivo não é suportada
ru: время создания файла не поддерживается

source: The statx syscall is not supported. At least Linux kernel 4.11 is needed
es: La llamada al sistema statx no está soportada. Se necesita al menos Linux kernel 4.11
pt: A syscall statx não é suportada. É necessário pelo menos o kernel Linux 4.11
ru: Системный вызов statx не поддерживается. Требуется как минимум Linux kernel 4.11

source: BTIME isn't supported
es: BTIME no está soportado

source: error getting the corresponding structure from fileinfo.Sys()
es: error al obtener la estructura correspondiente de fileinfo.Sys()
pt: erro ao obter a estrutura correspondente de fileinfo.Sys()
ru: ошибка получения соответствующей структуры от fileinfo.Sys()

source: not supported on windows
es: no soportado en Windows
pt: não suportado no Windows
ru: не поддерживается на windows

source: Name:
es: Nombre:
pt: Nome:
ru: Имя:

source: Size:
es: Tamaño:
pt: Tamanho:
ru: Размер:

source: Absolute path:
es: Ruta absoluta:
pt: Caminho absoluto:
ru: Абсолютный путь:

source: Physical path:
es: Ruta física:
pt: Caminho físico:
ru: Физический путь:

source: Modify:
es: Modificación:
pt: Modificação:
ru: Изменить:

source: Access:
es: Acceso:
pt: Acesso:
ru: Доступ:

source: Birth:
es: Creación:
pt: Criação:
ru: Создание:

source: Is directory:
es: Es directorio:
pt: É um diretório:
ru: Это каталог:

source: Permissions:
es: Permisos:
pt: Permissões:
ru: Разрешения:

source: UID/User:
es: UID/Usuario:
pt: UID/Usuário:
ru: UID/Пользователь:

source: GID/Group:
es: GID/Grupo:
pt: GID/Grupo:
ru: GID/Группа:

source: Checking the latest version available...
es: Verificando la última versión disponible...
pt: Verificando a versão mais recente disponível...
ru: Проверка доступной последней версии...

source: unsupported platform, try building fsize by yourself
es: plataforma no soportada, intenta compilar fsize tú mismo

source: NB! It seems that you are in a NixOS.
es: ¡Atención! Parece que estás en NixOS.
pt: Atenção! Parece que você está em um NixOS.
ru: Внимание! Похоже, вы находитесь в NixOS.

source: Due to the non-standard filesystem implementation of the environment, the update command may not work as expected.
es: Debido a la implementación no estándar del sistema de archivos del entorno, el comando de actualización puede no funcionar como se espera.
pt: Devido à implementação não padrão do sistema de arquivos do ambiente, o comando de atualização pode não funcionar como esperado.
ru: Из-за нестандартной реализации файловой системы в этой среде команда обновления может не работать должным образом.

source: Do you want to proceed with the update?
es: ¿Quieres proceder con la actualización?
pt: Deseja prosseguir com a atualização?
ru: Вы хотите продолжить обновление?

source: Yes
es: Sí
pt: Sim
ru: Да

source: error running confirm dialog
es: error al ejecutar el diálogo de confirmación
pt: erro ao executar diálogo de confirmação
ru: ошибка при запуске диалогового окна подтверждения

source: The command has been cancelled.
es: El comando ha sido cancelado.
pt: O comando foi cancelado.
ru: Команда была отменена.

source: error renaming the old executable [%s] to: %v
es: error al renombrar el ejecutable antiguo [%s] a: %v
pt: erro ao renomear o executável antigo [%s] para: %v
ru: ошибка переименования старого исполняемого файла [%s] в: %v

source: error getting http response: %v
es: error al obtener respuesta HTTP: %v
pt: erro ao obter resposta HTTP: %v
ru: ошибка получения http ответа: %v

source: Downloading latest version...
es: Descargando la última versión...
pt: Baixando a versão mais recente...
ru: Загрузка последней версии...

source: Error downloading binary to %s: %v
es: Error al descargar el binario a %s: %v
pt: Erro ao baixar o binário para %s: %v
ru: Ошибка загрузки бинарного файла в %s: %v

source: Reversing changes...
es: Revirtiendo cambios...
pt: Revertendo alterações...
ru: Отмена изменений...

source: error reversing changes: failed to rename %s to %s: %v
es: error al revertir cambios: falló al renombrar %s a %s: %v
pt: erro ao reverter alterações: falha ao renomear %s para %s: %v
ru: ошибка отмены изменений: не удалось переименовать %s в %s: %v

source: error finishing the progress bar: %s
es: error al finalizar la barra de progreso: %s
pt: Erro ao finalizar a barra de progresso: %s
ru: ошибка при завершении индикатора выполнения: %s

source: error removing old executable: %s
es: error al eliminar el ejecutable antiguo: %s
pt: Erro ao remover o executável antigo: %s
ru: ошибка при удалении старого исполняемого файла: %s

source: Updating completions...
es: Actualizando autocompletaciones...
pt: Atualizando arquivos de autocompletar...
ru: Обновление автозаполнений...

source: error updating the completions: %s
es: error al actualizar las autocompletaciones: %s
pt: Erro ao atualizar os arquivos de autocompletar: %s
ru: ошибка при обновлении завершений: %s

source: Upgrade completed successfully
es: Actualización completada exitosamente
pt: Atualização concluída com sucesso
ru: Обновление успешно завершено

source: %s detected, reversing changes before finishing program...
es: %s detectado, revirtiendo cambios antes de finalizar el programa...
pt: %s detectado, revertendo alterações antes de finalizar o programa...
ru: Обнаружено %s, отмена изменений перед завершением программы...

source: error removing %s completions: %s
es: error al eliminar autocompletaciones %s: %s
pt: erro ao remover arquivos de autocompletar %s: %s
ru: ошибка при удалении завершений %s: %s

source: Do you want to update the completions?
es: ¿Quieres actualizar las autocompletaciones?
pt: Deseja atualizar os arquivos de autocompletar?
ru: Вы хотите обновить завершения?

source: %s not found.
es: %s no encontrado.
pt: %s não encontrado.
ru: %s не найдено.

source: error creating completion directory: %s
es: error al crear directorio de autocompletación: %s
pt: erro ao criar diretório de autocompletar: %s
ru: ошибка при создании каталога завершения: %s

source: %d files, %d errors, total size: %s
es: %d archivos, %d errores, tamaño total: %s
pt: %d arquivos, %d erros, tamanho total: %s
ru: %d файлов, %d ошибок, общий размер: %s

source: Reading "%s"...
es: Leyendo "%s"...
pt: Lendo "%s"...
ru: Чтение "%s"...

source: too many warns (%d)
es: demasiadas advertencias (%d)
pt: muitos avisos (%d)
ru: слишком много предупреждений (%d)

source: ERROR:
pt: ERRO:
ru: ОШИБКА:

source: No
pt: Não
ru: Нет
